Revit 2027 API
MeshFromGeometryOperationResult.GetMesh Method
 This returns a valid mesh only for the first call. Later calls will throw an exception as the mesh is no longer valid in this object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Mesh GetMesh()
Public Function GetMesh As Mesh
public:
Mesh^ GetMesh()
member GetMesh : unit -> Mesh
Return Value
Mesh
 Mesh which built.
Exceptions
Exception | Condition
InvalidOperationException |  The Mesh has already been accessed by a previous GetMesh() call, and is no longer available for use.
See Also
Reference
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace